# SelectLinks Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionUIOptions..::..SelectLinks Property
SelectionUIOptions Class See Also
---
Indicates whether Revit and CAD link instances can be selected.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool SelectLinks { get; set; }
```

Visual Basic
---
```text
Public Property SelectLinks As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SelectLinks {
	bool get ();
	void set (bool value);
}
```

# Remarks
When this setting is false, users cannot directly select link instances or elements within them in the canvas. This makes it easy for the user to avoid accidentally selecting and moving links. When this setting is true, users can select link instances.
# See Also
SelectionUIOptions Class
Autodesk.Revit.UI Namespace